app/controllers/admin/blogs_controller.rb

  def index
    @blogs = Blog.unverified.paginate :page => params[:page], :per_page => 20
---
SELECT * FROM `blogs` WHERE (`blogs`.`verified` = 0) ORDER BY created_at DESC LIMIT 0, 20