app/controllers/admin/photos_controller.rb

SELECT * FROM `photos` WHERE (`photos`.`verified` = 0) ORDER BY created_at DESC LIMIT 0, 20
---
  def index
    @photos = Photo.unverified.paginate :page => params[:page], :per_page => 20

UPDATE `photos` SET `updated_at` = '2010-02-24 09:21:56', `verified` = 1 WHERE `id` = 1
---
  def verify
    @photo.verified = 1
    if @photo.save

UPDATE `photos` SET `updated_at` = '2010-02-24 09:24:57', `verified` = 2 WHERE `id` = 1
---
  def unverify
    @photo.verified = 2
    if @photo.save