app/controllers/admin/users_controller.rb

  def index
    @users = User.activated.paginate :page => params[:page], :per_page => 20
---
SELECT count(*) AS count_all FROM `users`