app/controllers/user/albums_controller.rb

SELECT * FROM `albums` WHERE (`albums`.owner_id = 1) AND ( (`albums`.`type` = 'PersonalAlbum' ) ) ORDER BY uploaded_at DESC
---
  def index
		cond = params[:game_id].nil? ? {} : {:game_id => params[:game_id]}
    @albums = @user.albums.viewable(relationship, :conditions => cond).push @user.avatar_album
		@albums = @albums.paginate :page => params[:page], :per_page => 10

SELECT * FROM `comments` WHERE (`comments`.commentable_id = 60 AND `comments`.commentable_type = 'Album') ORDER BY created_at ASC
SELECT * FROM `photos` WHERE (`photos`.album_id = 60) AND ( (`photos`.`type` = 'PersonalPhoto' ) ) ORDER BY created_at DESC LIMIT 0, 12
---
  def show
		@comments = @album.comments
    @photos = @album.photos.paginate :page => params[:page], :per_page => 12

INSERT INTO `albums` (`created_at`, `poster_id`, `title`, `owner_id`, `type`, `cover_id`, `uploaded_at`, `game_id`, `privilege`, `description`, `comments_count`, `sharings_count`, `photos_count`) VALUES('2010-02-24 09:15:56', 1, 'aa', 1, 'PersonalAlbum', NULL, NULL, 319, 1, 'aaaa', 0, 0, 0)
---
  def create
    @album = current_user.albums.build(params[:album] || {})
    unless @album.save