app/controllers/user/blogs_controller.rb

UPDATE `blogs` SET `updated_at` = '2010-02-24 09:08:03', `title` = 'uuuuuuuuuuuu', `verified` = 0 WHERE `id` = 3
---
  def update
    if @blog.update_attributes((params[:blog] || {}).merge({:poster_id => current_user.id, :draft => false}))