app/controllers/user/guilds_controller.rb

SELECT * FROM `guilds` WHERE (`guilds`.president_id = 1)
---
  def index
		cond = params[:game_id].nil? ? {} : {:game_id => params[:game_id]}
    @guilds = @user.guilds.find(:all, :conditions => cond).paginate :page => params[:page], :per_page => 10