app/controllers/user/polls_controller.rb

SELECT * FROM `votes` WHERE (`votes`.`voter_id` = 1) AND (`votes`.poll_id = 3) LIMIT 1
SELECT * FROM `polls`
---
  def show
		@vote = @poll.votes.find_by_voter_id(current_user.id)
    @vote_feeds = current_user.vote_feed_items.map(&:originator).find_all {|v| v.poll_id == @poll.id}