app/controllers/user/profiles_controller.rb

SELECT * FROM `feed_deliveries` WHERE (`feed_deliveries`.recipient_id = 1 AND `feed_deliveries`.recipient_type = 'Profile') ORDER BY created_at DESC LIMIT 5
---
  def show
		@blogs = @user.blogs[0..2]
		@albums = @user.active_albums[0..2]
		@feed_deliveries = @profile.feed_deliveries.find(:all, :limit => FirstFetchSize, :order => 'created_at DESC')