app/controllers/user/sharings_controller.rb

  def create
    @sharing = @shareable.sharings.build(params[:sharing].merge({:poster_id => current_user.id}))
    if @sharing.save
---
INSERT INTO `sharings` (`shareable_type`, `created_at`, `title`, `poster_id`, `digs_count`, `shareable_id`, `reason`, `comments_count`, `verified`) VALUES('Photo', '2010-02-24 09:26:57', '头像1', 1, 0, 1, '啊啊啊啊啊啊啊啊', 0, 0)