app/controllers/user/statuses_controller.rb

  def index
    @statuses = @user.statuses.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM `statuses` WHERE (`statuses`.poster_id = 1) ORDER BY created_at DESC LIMIT 0, 5

  def create
    @status = current_user.statuses.build((params[:status] || {}).merge({:poster_id => current_user.id}))
    unless @status.save
---
INSERT INTO `statuses` (`created_at`, `poster_id`, `updated_at`, `content`, `comments_count`, `verified`) VALUES('2010-02-24 09:17:22', 1, '2010-02-24 09:17:22', 'aaaaaaaaa', 0, 0)