app/controllers/user/videos_controller.rb

SELECT * FROM `videos` WHERE (`videos`.poster_id = 1) ORDER BY created_at DESC
---
  def index
		cond = params[:game_id].nil? ? {} : {:game_id => params[:game_id]}
    @videos = @user.videos.viewable(relationship, :conditions => cond).paginate :page => params[:page], :per_page => 10