app/controllers/user/avatars/albums_controller.rb

  def show
    @photos = @album.photos.paginate :page => params[:page], :per_page => 16
---
SELECT * FROM `photos` WHERE (`photos`.album_id = 1) AND ( (`photos`.`type` = 'Avatar' ) ) ORDER BY created_at DESC LIMIT 0, 16