app/controllers/user/avatars/photos_controller.rb

  def create
    @photo = @album.photos.build(params[:photo])
    if @photo.save
---
INSERT INTO `photos` (`size`, `created_at`, `album_id`, `poster_id`, `notation`, `content_type`, `digs_count`, `thumbnail`, `updated_at`, `type`, `parent_id`, `filename`, `height`, `comments_count`, `game_id`, `privilege`, `verified`, `tags_count`, `sharings_count`, `width`) VALUES(3957, '2010-02-24 09:20:15', 1, 1, NULL, 'image/jpeg', 0, NULL, '2010-02-24 09:20:15', 'Avatar', NULL, 'head_1162g70.jpg', NULL, 0, NULL, 2, 0, 0, 0, NULL)

  def update
    if @photo.update_attributes(params[:photo])
---
UPDATE `photos` SET `updated_at` = '2010-02-24 09:24:22', `verified` = 0, `notation` = '黑黑' WHERE `id` = 1