app/controllers/user/guilds/albums_controller.rb

SELECT * FROM `memberships` WHERE (`memberships`.`user_id` = 1) AND (`memberships`.guild_id = 1) LIMIT 1
SELECT * FROM `comments` WHERE (`comments`.commentable_id = 57 AND `comments`.commentable_type = 'Album') ORDER BY created_at ASC
SELECT * FROM `photos` WHERE (`photos`.album_id = 57) AND ( (`photos`.`type` = 'GuildPhoto' ) ) ORDER BY created_at DESC LIMIT 0, 12
---
  def show
    @membership = @guild.memberships.find_by_user_id(current_user.id)
    @comments = @album.comments
    @photos = @album.photos.paginate :page => params[:page], :per_page => 12