app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_email(params[:email])
---
SELECT * FROM `users` WHERE (email = 'gaoxh04@gmail.com' and activated_at IS NOT NULL) LIMIT 1